app/views/tasks/index.html.erb

<table>
    <% @project.task.each do |task| %>
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]