app/views/projects/show.html.erb

    </tr>
    <% @project.access_to_project.each do |access| %>
---
SELECT "access_to_projects".* FROM "access_to_projects" WHERE "access_to_projects"."project_id" = ?  [["project_id", 4]]