app/controllers/access_to_projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def new
        @project = Project.find(params[:project_id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "access_to_projects" ("user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["project_id", 4], ["created_at", "2017-10-12 07:12:19.127329"], ["updated_at", "2017-10-12 07:12:19.127329"]]
---
    def create
        @project = Project.find(params[:project_id])
        @access = @project.access_to_project.create(access_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "access_to_projects".* FROM "access_to_projects" WHERE "access_to_projects"."project_id" = ? AND "access_to_projects"."id" = ? LIMIT ?  [["project_id", 4], ["id", 1], ["LIMIT", 1]]
DELETE FROM "access_to_projects" WHERE "access_to_projects"."id" = ?  [["id", 1]]
---
    def destroy
        @project = Project.find(params[:project_id])
        @access = @project.access_to_project.find(params[:id])
        @access.destroy