app/controllers/projects_controller.rb

    def index
    #   @project_list = Project.where(user_id: current_user.id)
        @project_list = Project.where('user_id=? OR id in (?)', current_user.id, AccessToProject.need_id(current_user))
---
SELECT "access_to_projects".* FROM "access_to_projects" WHERE "access_to_projects"."user_id" = ?  [["user_id", 2]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]

    def create
      @project = Project.new(project_params)
      @project.user_id = current_user.id
      if @project.save
---
INSERT INTO "projects" ("name", "comment", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Приве"], ["comment", "Привет"], ["created_at", "2017-10-11 12:40:04.248633"], ["updated_at", "2017-10-11 12:40:04.248633"], ["user_id", 1]]

    def update
      @project = Project.find(params[:id])
      if @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "comment" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["comment", "Лучшие клиенты :)"], ["updated_at", "2017-10-11 11:40:31.741670"], ["id", 1]]