app/controllers/tasks_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def index
      @project = Project.find(params[:project_id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "priority", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Как оно?"], ["priority", 1], ["project_id", 4], ["created_at", "2017-10-12 09:41:04.619878"], ["updated_at", "2017-10-12 09:41:04.619878"]]
---
  def create
      @project = Project.find(params[:project_id])
      @task = @project.task.create(task_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 4], ["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]
---
  def destroy
      @project = Project.find(params[:project_id])
      @task = @project.task.find(params[:id])
      @task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", 1], ["updated_at", "2017-10-12 11:10:26.500503"], ["id", 11]]
---
  def update_done
    @task = Task.find(params[:task][:id])
    @task.update(params.require(:task).permit(:id,:done))